src/Zepluf/Bundle/StoreBundle/Component/Shipment/Carrier/UPS/XOLTResult.xml

Request: 
<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://www.ups.com/XMLSchema/XOLTWS/Common/v1.0" xmlns:ns2="http://www.ups.com/XMLSchema/XOLTWS/Rate/v1.1" xmlns:ns3="http://www.ups.com/XMLSchema/XOLTWS/UPSS/v1.0"><SOAP-ENV:Header><ns3:UPSSecurity><ns3:UsernameToken><ns3:Username>rubikin</ns3:Username><ns3:Password>635Doxuanhop</ns3:Password></ns3:UsernameToken><ns3:ServiceAccessToken><ns3:AccessLicenseNumber>9CB176ED636EF975</ns3:AccessLicenseNumber></ns3:ServiceAccessToken></ns3:UPSSecurity></SOAP-ENV:Header><SOAP-ENV:Body><ns2:RateRequest><ns1:Request><ns1:RequestOption>Shop</ns1:RequestOption></ns1:Request><ns2:PickupType><ns2:Code>01</ns2:Code><ns2:Description>Daily Pickup</ns2:Description></ns2:PickupType><ns2:Shipment><ns2:Shipper><ns2:Name>Imani Carr</ns2:Name><ns2:ShipperNumber>222006</ns2:ShipperNumber><ns2:Address><ns2:AddressLine>Southam Rd</ns2:AddressLine><ns2:AddressLine>4 Case Cour</ns2:AddressLine><ns2:AddressLine>Apt 3B</ns2:AddressLine><ns2:City>Timonium</ns2:City><ns2:StateProvinceCode>MD</ns2:StateProvinceCode><ns2:PostalCode>21093</ns2:PostalCode><ns2:CountryCode>US</ns2:CountryCode></ns2:Address></ns2:Shipper><ns2:ShipTo><ns2:Address><ns2:City>Nha Trang</ns2:City><ns2:CountryCode>VN</ns2:CountryCode><ns2:ResidentialAddressIndicator></ns2:ResidentialAddressIndicator></ns2:Address></ns2:ShipTo><ns2:ShipFrom><ns2:Address><ns2:PostalCode>90003</ns2:PostalCode><ns2:CountryCode>US</ns2:CountryCode></ns2:Address></ns2:ShipFrom><ns2:Package><ns2:PackagingType><ns2:Code>00</ns2:Code><ns2:Description>Rate</ns2:Description></ns2:PackagingType><ns2:PackageWeight><ns2:UnitOfMeasurement><ns2:Code>LBS</ns2:Code></ns2:UnitOfMeasurement><ns2:Weight>10</ns2:Weight></ns2:PackageWeight></ns2:Package><ns2:ShipmentServiceOptions/></ns2:Shipment></ns2:RateRequest></SOAP-ENV:Body></SOAP-ENV:Envelope>

Response: 
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Header/><soapenv:Body><rate:RateResponse xmlns:rate="http://www.ups.com/XMLSchema/XOLTWS/Rate/v1.1"><common:Response xmlns:common="http://www.ups.com/XMLSchema/XOLTWS/Common/v1.0"><common:ResponseStatus><common:Code>1</common:Code><common:Description>Success</common:Description></common:ResponseStatus><common:Alert><common:Code>110971</common:Code><common:Description>Your invoice may vary from the displayed reference rates</common:Description></common:Alert><common:TransactionReference/></common:Response><rate:RatedShipment><rate:Service><rate:Code>08</rate:Code><rate:Description/></rate:Service><rate:RatedShipmentAlert><rate:Code>110971</rate:Code><rate:Description>Your invoice may vary from the displayed reference rates</rate:Description></rate:RatedShipmentAlert><rate:BillingWeight><rate:UnitOfMeasurement><rate:Code>LBS</rate:Code><rate:Description>Pounds</rate:Description></rate:UnitOfMeasurement><rate:Weight>10.0</rate:Weight></rate:BillingWeight><rate:TransportationCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>227.81</rate:MonetaryValue></rate:TransportationCharges><rate:ServiceOptionsCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>0.00</rate:MonetaryValue></rate:ServiceOptionsCharges><rate:TotalCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>227.81</rate:MonetaryValue></rate:TotalCharges><rate:RatedPackage><rate:TransportationCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>0.00</rate:MonetaryValue></rate:TransportationCharges><rate:ServiceOptionsCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>0.00</rate:MonetaryValue></rate:ServiceOptionsCharges><rate:TotalCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>0.00</rate:MonetaryValue></rate:TotalCharges><rate:Weight>10.0</rate:Weight><rate:BillingWeight><rate:UnitOfMeasurement><rate:Code>LBS</rate:Code><rate:Description>Pounds</rate:Description></rate:UnitOfMeasurement><rate:Weight>0.0</rate:Weight></rate:BillingWeight></rate:RatedPackage></rate:RatedShipment><rate:RatedShipment><rate:Service><rate:Code>65</rate:Code><rate:Description/></rate:Service><rate:RatedShipmentAlert><rate:Code>110971</rate:Code><rate:Description>Your invoice may vary from the displayed reference rates</rate:Description></rate:RatedShipmentAlert><rate:BillingWeight><rate:UnitOfMeasurement><rate:Code>LBS</rate:Code><rate:Description>Pounds</rate:Description></rate:UnitOfMeasurement><rate:Weight>10.0</rate:Weight></rate:BillingWeight><rate:TransportationCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>234.98</rate:MonetaryValue></rate:TransportationCharges><rate:ServiceOptionsCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>0.00</rate:MonetaryValue></rate:ServiceOptionsCharges><rate:TotalCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>234.98</rate:MonetaryValue></rate:TotalCharges><rate:GuaranteedDelivery><rate:BusinessDaysInTransit>1</rate:BusinessDaysInTransit></rate:GuaranteedDelivery><rate:RatedPackage><rate:TransportationCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>0.00</rate:MonetaryValue></rate:TransportationCharges><rate:ServiceOptionsCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>0.00</rate:MonetaryValue></rate:ServiceOptionsCharges><rate:TotalCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>0.00</rate:MonetaryValue></rate:TotalCharges><rate:Weight>10.0</rate:Weight><rate:BillingWeight><rate:UnitOfMeasurement><rate:Code>LBS</rate:Code><rate:Description>Pounds</rate:Description></rate:UnitOfMeasurement><rate:Weight>0.0</rate:Weight></rate:BillingWeight></rate:RatedPackage></rate:RatedShipment></rate:RateResponse></soapenv:Body></soapenv:Envelope>
